{
  "generatedAt": "2026-02-12T19:58:06.488Z",
  "items": [
    {
      "title": "Football Daily | Jim Ratcliffe’s special brand of patriotism and a classic non-apology apology",
      "link": "https://www.theguardian.com/football/2026/feb/12/football-daily-newsletter-jim-ratcliffe-manchester-united",
      "date": "2026-02-12T15:33:14.000Z",
      "source": "The Guardian (UK News)",
      "tags": [
        "witch"
      ],
      "excerpt": "Sign up now! Sign up now! Sign up now? Sign up now! There are a lot of billionaires making global headlines at the moment and even if we were dying of thirst, Football Daily wouldn’t go for a pint with any of them. Big Sir Jim Ratcliffe almost certainly wouldn’t want to come for…"
    },
    {
      "title": "Handel: Sosarme album review – Marco Angioloni makes the case for this little-known work",
      "link": "https://www.theguardian.com/music/2026/feb/12/handel-sosarme-album-review-opera-royal-de-versaille-marco-angioloni",
      "date": "2026-02-12T15:00:16.000Z",
      "source": "The Guardian (UK News)",
      "tags": [
        "myth",
        "witch"
      ],
      "excerpt": "Opéra Royal de Versailles/Angioloni (Château de Versailles Spectacles) Doubling as vocalist and conductor, Angiolini is joined by fine singers in this rarely recorded late work. Giacomo Nanni’s sonorous ‘Fra l’ombre e gl’orrori’ is a particular highlight Premiered in 1732, Sosar…"
    },
    {
      "title": "Method dressing: nine actors who stayed wildly in character on the red carpet",
      "link": "https://www.theguardian.com/fashion/2026/feb/11/method-dressing-nine-actors-who-stayed-in-character-red-carpet",
      "date": "2026-02-11T06:00:09.000Z",
      "source": "The Guardian (UK News)",
      "tags": [
        "mushroom"
      ],
      "excerpt": "Whether it’s Zendaya in tennis-inspired shoes, Cynthia Erivo dressed in green, Margot Robbie as Barbie or Jenna Ortega in shredded black leather, today’s movie stars rarely disappoint on the promo circuit ‘Have you ever heard of a female actor that was method?” Kristen Stewart s…"
    },
    {
      "title": "The big AI job swap: why white-collar workers are ditching their careers",
      "link": "https://www.theguardian.com/technology/2026/feb/11/big-ai-job-swap-white-collar-workers-ditching-their-careers",
      "date": "2026-02-11T05:00:08.000Z",
      "source": "The Guardian (UK News)",
      "tags": [
        "witch"
      ],
      "excerpt": "As AI job losses rise in the professional sector, many are switching to more traditional trades. But how do they feel about accepting lower pay – and, in some cases, giving up their vocation? California-based Jacqueline Bowman had been dead set on becoming a writer since she was…"
    },
    {
      "title": "Romeo Is a Dead Man review – a misfire from a storied gaming provocateur",
      "link": "https://www.theguardian.com/games/2026/feb/10/romeo-is-a-dead-man-review-grasshopper-manufacture-suda51",
      "date": "2026-02-10T14:11:49.000Z",
      "source": "The Guardian (UK News)",
      "tags": [
        "legend"
      ],
      "excerpt": "PlayStation 5 (version tested), Xbox, PC; Grasshopper Manufacture/Marvelous Inc After some dumb fun hacking at zombies, legendary developer Suda51’s first original game in a decade sadly only delivers a host of incoherent disappointments Ever since he baffled GameCube owners wit…"
    },
    {
      "title": "Situational awareness: How humans stay aware whilst foraging",
      "link": "https://www.eatweeds.co.uk/sa",
      "date": "2026-01-06T08:41:51.000Z",
      "source": "Eatweeds (Foraging)",
      "tags": [
        "foraging"
      ],
      "excerpt": "I’ve been thinking about situational awareness lately. Not the military jargon kind. I mean the real thing. The awareness that kept our ancestors alive ... Continue"
    },
    {
      "title": "Roma Lister, Aradia, and the Speculative Origins of a Witchcraft Revival\n",
      "link": "https://publicdomainreview.org/essay/roma-lister-aradia",
      "date": "2025-11-12T13:32:00.000Z",
      "source": "The Public Domain Review (Folklore & Culture)",
      "tags": [
        "witch"
      ],
      "excerpt": "In 1899, Charles Godfrey Leland published Aradia, “the gospel of the witches”, containing a goddess-orientated creation and saviour narrative, purported to descend from an ancient, hermetic tradition of witchcraft in Italy. A. D. Manns explores this text via an enchanting conjec…"
    },
    {
      "title": "Animal Costumes from the 1862 Fairytale Ball of the Jung-München Artist’s Association\n",
      "link": "https://publicdomainreview.org/collection/maskenfest",
      "date": "2025-10-30T11:41:00.000Z",
      "source": "The Public Domain Review (Folklore & Culture)",
      "tags": [
        "fairy"
      ],
      "excerpt": "Photographs from a costume ball featuring fairytale fables."
    },
    {
      "title": "“That’s Why We Become Witches”: Sylvia Townsend Warner’s Lolly Willowes (1926)\n",
      "link": "https://publicdomainreview.org/collection/lolly-willowes",
      "date": "2025-10-28T15:28:00.000Z",
      "source": "The Public Domain Review (Folklore & Culture)",
      "tags": [
        "witch"
      ],
      "excerpt": "A novel about a woman who throws off the yoke of patriarchy to become a witch."
    },
    {
      "title": "Off with Their Heads: Illustrations of Blemmyes (ca. 1175–1724)\n",
      "link": "https://publicdomainreview.org/collection/blemmyes",
      "date": "2025-06-11T16:34:00.000Z",
      "source": "The Public Domain Review (Folklore & Culture)",
      "tags": [
        "myth"
      ],
      "excerpt": "Depictions of the mythical creatures known as Blemmyes: humanoids whose eyes, nose, and mouth are embedded in their breast."
    },
    {
      "title": "Bernard Sleigh’s Anciente Mappe of Fairyland (ca. 1920 edition)\n",
      "link": "https://publicdomainreview.org/collection/an-anciente-mappe-of-fairyland",
      "date": "2025-05-28T11:58:00.000Z",
      "source": "The Public Domain Review (Folklore & Culture)",
      "tags": [
        "myth",
        "fairy"
      ],
      "excerpt": "A stunning six-foot-long map that joins the worlds of various myths and stories for the childhood adventurer."
    },
    {
      "title": "Modern Babylon: Ziggurat Skyscrapers and Hugh Ferriss’ Retrofuturism\n",
      "link": "https://publicdomainreview.org/essay/modern-babylon-ziggurat-skyscrapers-and-hugh-ferriss-retrofuturism",
      "date": "2025-04-09T14:29:00.000Z",
      "source": "The Public Domain Review (Folklore & Culture)",
      "tags": [
        "myth"
      ],
      "excerpt": "In the early twentieth century, architects turned to a newly discovered past to craft novel visions of the future: the ancient history of Mesopotamia. Eva Miller traces how both the mythology of Babel and reconstructions of stepped-pyramid forms influenced skyscraper design, spe…"
    }
  ]
}